Tekla Open API Reference for Tekla Structures 2025
PointCloud.Name Property
 Gets or sets the point clouds name. Abbreviated from the point cloud file name. Cannot be given by user.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
PointCloud Class
Tekla.Structures.Model Namespace